// Add your own markers to this file.

var MAPCRAFTER_MARKERS = [
	
	
	
	//--------------------------------------------------------------------------------------------------------------------------
	//                                                       Images
	//--------------------------------------------------------------------------------------------------------------------------
	
	
	
	{
		"id" : "homes",
		"name" : "Дома",
		"icon" : "home.png",
		"iconSize" : [32, 32],
		"showDefault" : true,
		"markers" : {
			"pure" : [
				{"pos" : [-91, 390, 64], "title" : "Дом 1523132/Звезда смерти"},
				{"pos" : [-163, 495, 64], "title" : "Дом ENKA"},
				{"pos" : [-267, 520, 64], "title" : "Дом WaterDemon-a"},
				{"pos" : [-434, 532, 64], "title" : "Особняк WaterDemon-a"},
				{"pos" : [-100, 551, 64], "title" : "Дом SadMoon"},
				{"pos" : [-10, 385, 64], "title" : "Дом leovolk"},
				{"pos" : [-16, 442, 64], "title" : "Банк leovolk"},
				{"pos" : [-327, 597, 64], "title" : "Дом HISENBERG-a"},
				{"pos" : [452, 238, 64], "title" : "Маяк Morkovka228"},
				{"pos" : [11903, 20969, 64], "title" : "#1 Дом tur1k'a"},
				{"pos" : [13276, 19514, 64], "title" : "#2 Дом tur1k'a и Stacy"},
				{"pos" : [730, 1786, 64], "title" : "Дом Sun Serega"},
				{"pos" : [-248, 360, 64], "title" : "Дом AT13"},
				{"pos" : [7300, 740, 64], "title" : "Дом Dragon165"},
				{"pos" : [-150, 315, 64], "title" : "Дом Serfing-a"},
				{"pos" : [-160, 385, 64], "title" : "Дом arhitector-a"},
				{"pos" : [-71, 459, 64], "title" : "Макдак AlanFox-a"},
				{"pos" : [-122, 502, 64], "title" : "Дом Lignium-a"},
				{"pos" : [-151, 512, 64], "title" : "Первый общий дом"},
				{"pos" : [-529, 1364, 64], "title" : "Замок Mars129"},
				{"pos" : [-1696, 2437, 64], "title" : "Сторожевая башня Crasis"},
				{"pos" : [-1683, 2262, 64], "title" : "Мастерская Санты"},
				{"pos" : [-238, 406, 64], "title" : "Дом ostapchikus-a"},
				{"pos" : [-162, 436, 64], "title" : "Новый Общий дом"},
				{"pos" : [-121, 472, 64], "title" : "Магазин Sun Serega"},
				{"pos" : [116, 332, 64], "title" : "Лошадиное ранчо Morkovka228"},
				{"pos" : [-40, 497, 64], "title" : "Дом чечЕнки от arhitector-a"},
				{"pos" : [-95, 448, 64], "title" : "Дом AlanFox-a"},
				{"pos" : [-321, 224, 64], "title" : "Общее ранчо"},
				{"pos" : [-11991, 187, 64], "title" : "Дом XpeHoK"},
				{"pos" : [-456, 631, 64], "title" : "Дом Borsk-a"}

			],
		},
	},
	{
		"id" : "farms",
		"name" : "Фермы",
		"icon" : "farm.png",
		"iconSize" : [32, 32],
		"showDefault" : false,
		"markers" : {
			"pure" : [
				{"pos" : [-372, 391, 64], "title" : "Мобоферма"},
				{"pos" : [310, 489, 64], "title" : "Мобоферма Kapiteon-a"},
				{"pos" : [302, 690, 64], "title" : "Ферма ведьм Kapiteon-a"},
				{"pos" : [-306, 713, 64], "title" : "Ферма скелетов"},
				{"pos" : [-18, 230, 64], "title" : "Ферма Железа"},
				{"pos" : [-1822, 603, 64], "title" : "Ферма Ведьм"},
				{"pos" : [-198, -1250, 64], "title" : "Ферма стражей"},
				{"pos" : [175, 517, 64], "title" : "Магазин жителей"},
				{"pos" : [163, 559, 64], "title" : "Склад фермы тростника, тыквы и арбузов"},
				{"pos" : [215, 587, 64], "title" : "Ферма пшеницы"},
				{"pos" : [178, 637, 64], "title" : "Ферма булыжника"},
				{"pos" : [644,1816, 64], "title" : "Ферма корусов Sun Serega"},
				{"pos" : [-3593,499, 64], "title" : "Ферма изумрудов"},
				{"pos" : [649,400, 64], "title" : "Ферма тростника"}

			],
			"nether" : [
				{"pos" : [231, -161, 64], "title" : "Ферма скелетов иссушителей"},
				{"pos" : [-18, 203, 64], "title" : "Ферма опыта свинозомби"},

			],
			"nether_caves" : [
				{"pos" : [231, -161, 64], "title" : "Ферма скелетов иссушителей"}

			],
			"pure_end" : [
				{"pos" : [1, 5, 64], "title" : "Ферма (дюпалка) песка"},
				{"pos" : [309, 57, 64], "title" : "Ферма жемчуга"},

			],
		},
	},
	{
		"id" : "portals",
		"name" : "Порталы",
		//"icon" : "portal.png",
		//стрелка у иконки показывала не на координаты а ниже, сбивало когда считаешь координаты
		//ещё много иконок показывает так мимо и пожалуй стоит поменять у некоторых точек особенно в разделе
		//"интересне" иконки как у дома санты красиса поставить картинку красиса
		//да, новая иконка слишком уж прозрачная хоть и лучше старой и да я создаю 10 версий потому что спешу)))
		"icon" : "http://1.bp.blogspot.com/-2WK_i_GpIjY/UF1fjkodMiI/AAAAAAAAASo/X2bzN20t7Mc/s1600/portalicon.png",
		"iconSize" : [32, 32],
		"showDefault" : true,
		"markers" : {
			"pure" : [
				{"pos" : [-47, 232, 64], "title" : "Спавн", "icon" : "spawn.png"},
				{"pos" : [-37, 225, 64], "title" : "Спавн"},
				{"pos" : [720, 1780, 64], "title" : "Портал в край #1"},
				{"pos" : [3421, -2708, 64], "title" : "Портал в край #2"},
				{"pos" : [7869, 4051, 64], "title" : "Портал в край #3"},
				{"pos" : [-164, 467, 64], "title" : "Общая деревня, портал в ад"},
				{"pos" : [173, 529, 64], "title" : "Фарм зона"}

			],
			"nether" : [
				{"pos" : [-22, 68, 64], "title" : "Хаб", "icon" : "spawn.png"},
				{"pos" : [-21, 65, 64], "title" : "Общая деревня"},
				{"pos" : [96, 222, 64], "title" : "Дом Sun Serega"},
				{"pos" : [427, -339.5, 64], "title" : "Портал в край #2"},
				{"pos" : [985, 506.5, 64], "title" : "Портал в край #3"},
				{"pos" : [1497, 2627, 64], "title" : "Дом tur1k"},
				{"pos" : [907, 85, 64], "title" : "Дом Dragon165"},
				{"pos" : [-33, -148, 64], "title" : "Ферма стражей"},
				{"pos" : [-362, 411, 64], "title" : "Грибной биом"},
				{"pos" : [239, -376, 64], "title" : "МЕСА"},
				{"pos" : [-187, -477, 64], "title" : "Биом плотного льда"},
				{"pos" : [-224, 71, 64], "title" : "Ферма изумрудов Sun_Sereg-и"}

			],
			"nether_caves" : [
				{"pos" : [-22, 68, 64], "title" : "Хаб", "icon" : "spawn.png"},
				{"pos" : [-21, 65, 64], "title" : "Общая деревня"},
				{"pos" : [96, 222, 64], "title" : "Дом Sun Serega"},
				{"pos" : [1497, 2627, 64], "title" : "Дом tur1k"},
				{"pos" : [907, 85, 64], "title" : "Дом Dragon165"},
				{"pos" : [-33, -148, 64], "title" : "Ферма стражей"},
				{"pos" : [-362, 411, 64], "title" : "Грибной биом"},
				{"pos" : [239, -376, 64], "title" : "МЕСА"},
				{"pos" : [-187, -477, 64], "title" : "Биом плотного льда"},
				{"pos" : [-224, 71, 64], "title" : "Ферма изумрудов Sun_Sereg-и"}

			],
			"pure_end" : [
				{"pos" : [0, 0, 64], "title" : "Спавн", "icon" : "spawn.png"},

			],
		},
	},
	{
		"id" : "poi",
		"name" : "Интересное",
		"icon" : "poi.png",
		"iconSize" : [32, 32],
		"showDefault" : false,
		"markers" : {
			"pure" : [
				{"pos" : [-2900,3300, 64], "title" : "Грибной биом"},
				{"pos" : [20266,20017, 64], "title" : "Грибной биом"},
				{"pos" : [9499,18747, 64], "title" : "Грибной биом"},
				{"pos" : [1380,-2570, 64], "title" : "МЕСА"},
				{"pos" : [-1461, -3254, 64], "title" : "Плотный лед"},
				{"pos" : [328, 998, 64], "title" : "Старая ферма слизней"},
				{"pos" : [-701, 1565, 64], "title" : "Ферма Legio"},
				{"pos" : [-764, 1543, 64], "title" : "Дом Legio"},
				{"pos" : [308, 255, 64], "title" : "Недострой Morkovka228"},
				{"pos" : [138, 908, 64], "title" : "Ферма хруса (Недострой)"},
				{"pos" : [597, 709, 64], "title" : "Ферма ведьм. Хз кто строил..."},
				{"pos" : [-764, 1338, 64], "title" : "Хз чей дом"},
				{"pos" : [-422, 404, 64], "title" : "Коробка чъя-то"},
				{"pos" : [-215, 218, 64], "title" : "Недострой на утесе"},
				{"pos" : [-179, 192, 64], "title" : "Огород"},
				{"pos" : [-247, 333, 64], "title" : "Руины"},
				{"pos" : [476, 1223, 64], "title" : "Место добычи песка сука рядом с домом Sun Serega ироды)))"},
				{"pos" : [45, 723, 64], "title" : "Бревна на земле WTF???"},
				{"pos" : [1306, 2611, 64], "title" : "Фермы куриц ??"},
				{"pos" : [1441, 2645, 64], "title" : "Биом цветочного леса"},
				{"pos" : [-111, 337, 64], "title" : "Сплиф"},
				{"pos" : [-475, 2544, 64], "title" : "Новая деревня"},
				{"pos" : [762, 1884, 64], "title" : "Места добычи песка"},
				{"pos" : [-192, 608, 64], "title" : "Подземная ферма Padawan-a"},
				{"pos" : [309, -1265, 64], "title" : "Ферма пассивных мобов (Недострой)"},
				{"pos" : [-5527, 237, 64], "title" : "Губок нет"},
				{"pos" : [-5525, -192, 64], "title" : "Губок нет"},
				{"pos" : [-5291, -627, 64], "title" : "Губок нет"},
				{"pos" : [-3943, 87, 64], "title" : "Губок нет"},
				{"pos" : [-31798, 31722, 64], "title" : "AMPLIFIED земля"},
				{"pos" : [-85, 835, 64], "title" : "Хрень с собакой Nekro"},
			],
			"nether" : [
				{"pos" : [-29,-81, 64], "title" : "Строения mrdaft"},

			],
		},
	},
	
	
	
	//--------------------------------------------------------------------------------------------------------------------------
	//                                                       Lines
	//--------------------------------------------------------------------------------------------------------------------------
	
	
	
	{
		"id" : "lines",
		"name" : "пути",
		"showDefault" : false,
		"createMarker" : function(ui, groupInfo, markerInfo) {
			
			var latlngs = [];
			latlngs.push(ui.mcToLatLng(markerInfo.p1[0], markerInfo.p1[1], 128));
			latlngs.push(ui.mcToLatLng(markerInfo.p2[0], markerInfo.p2[1], 128));
			
			return L.polyline(latlngs, {"color" : markerInfo.color});
			
		},
		"markers" : {
			"pure" : [
				{"p1" : [-164, 467],"p2" : [-31798, 31722],"color" : "#0000FF"},//AMPLIFIED
				{"p1" : [-164, 467],"p2" : [173, 529],"color" : "#000000"},//фарм зона
				{"p1" : [-164, 467],"p2" : [720, 1780],"color" : "#FF00FF"},//дом Sun Serega и порт в край 1
				{"p1" : [-164, 467],"p2" : [3421, -2708],"color" : "#FF00FF"},//порт в край 2
				{"p1" : [-164, 467],"p2" : [7869, 4051],"color" : "#FF00FF"},//порт в край 3
				{"p1" : [-164, 467],"p2" : [11903, 20969],"color" : "#FF0000"},//дом туры
				{"p1" : [-164, 467],"p2" : [-1822, 603],"color" : "#800000"},//ферма ведьм
				{"p1" : [-164, 467],"p2" : [-198, -1250],"color" : "#8080FF"},//ферма стражей
				{"p1" : [-164, 467],"p2" : [7300, 740],"color" : "#8B3030"},//дом драга
				{"p1" : [-164, 467],"p2" : [-3593,499],"color" : "#80FF80"},//ферма изумрудов
				{"p1" : [-164, 467],"p2" : [-1461, -3254],"color" : "#D0D0FF"},//плотный лёд
				{"p1" : [-164, 467],"p2" : [-2900,3300],"color" : "#80696D"},//грибной остров
			],
			"nether" : [
				{"p1" : [-22, 68],"p2" : [427, -339.5],"color" : "#FF00FF"},//край 2
				{"p1" : [-22, 68],"p2" : [985, 506.5],"color" : "#FF00FF"},//край 3
				{"p1" : [-22, 68],"p2" : [907, 85],"color" : "#808080"},//дом драга
				{"p1" : [-22, 68],"p2" : [-362, 411],"color" : "#FF00FF"},//грибной биом
				{"p1" : [-22, 68],"p2" : [239, -376],"color" : "#FF0000"},//меза
				{"p1" : [-22, 68],"p2" : [-187, -477],"color" : "#FFFFFF"},//плотный лёд
			],
		},
	},
	
	
	
	//--------------------------------------------------------------------------------------------------------------------------
	//                                                       test
	//--------------------------------------------------------------------------------------------------------------------------
	
	
	
	{
		"id" : "test",
		"name" : "test",
		"showDefault" : false,
		"createMarker" : function(ui, groupInfo, markerInfo) {
			
			var latlngs = [];
			latlngs.push(ui.mcToLatLng(markerInfo.p[0][0], markerInfo.p[0][1], 128));
			latlngs.push(ui.mcToLatLng(markerInfo.p[1][0], markerInfo.p[0][1], 128));
			latlngs.push(ui.mcToLatLng(markerInfo.p[1][0], markerInfo.p[1][1], 128));
			latlngs.push(ui.mcToLatLng(markerInfo.p[0][0], markerInfo.p[1][1], 128));
			
			return L.polygon(
				latlngs,
				{
				color : markerInfo.color,
				fillOpacity : 0.0
				}
				);
			
		},
		"markers" : {
			"pure" : [
				{"p" : [[ -620,2350 ],[ -330,2790 ]],"color" : "#FF80FF"},
			],
		},
		
	},
	
];
